//个人所得税是分阶梯分别某范围内的所得税,起征点为5000,（5000,8000]为3%；（8000,1.7万]为10%；
//（1.7万,3万]为20%；（3万,4万]25%；（4万,6万]30%,（6万,8.5万]35%;>8.5 ,45%从键盘输入当月收入，
//求应缴纳所得税？(输出保留两位小数)，例如：某人20000元，则税为：（20000-17000）*0.2+（17000-8000）*0.1+（8000-5000）*0.3，
//输入输出格式如下。
#include <stdio.h>

int main()
{
	float tax = 0.0, money, temp;
	scanf("%f", &money);
	temp = money;

	if (temp > 85000) {
		tax += (temp - 85000) * 0.45;
		temp = 85000;
	}

	if (temp > 60000) {
		tax += (temp - 60000) * 0.35;
		temp = 60000;
	}

	if (temp > 40000) {
		tax += (temp - 40000) * 0.30;
		temp = 40000;
	}

	if (temp > 30000) {
		tax += (temp - 30000) * 0.25;
		temp = 30000;
	}

	if (temp > 17000) {
		tax += (temp - 17000) * 0.20;
		temp = 17000;
	}

	if (temp > 8000) {
		tax += (temp - 8000) * 0.10;
		temp = 8000;
	}

	if (temp > 5000) {
		tax += (temp - 5000) * 0.03;
		temp = 5000;
	}

	printf("月收入%.2f,个税为:%.2f元\n", money, tax);

	return 0;
}

