#include <stdio.h>

/*
10高考真题第一问
输入输出样例
100
打折后的金额为 95.000000
-114514
请输入正常的金额
600
打折后的金额为 510.000000
*/
void test_1() {
	float P;
	scanf("%f", &P);

	float d;
	if(P < 0) {
		printf("请输入正常的金额\n");
	} else {
		if(P < 100) {
			d = 0.0;
		} else if(P < 200) {
			d = 0.05;
		} else if(P < 500) {
			d = 0.10;
		} else if(P < 1000) {
			d = 0.15;
		} else if(P >= 1000) {
			d = 0.20;
		}

		printf("打折后的金额为 %f \n", P - (P * d));
	}
}

/*
10高考真题第二问
输出样例
1*1=1
2*1=2 2*2=4
3*1=3 3*2=6 3*3=9
4*1=4 4*2=8 4*3=12 4*4=16
5*1=5 5*2=10 5*3=15 5*4=20 5*5=25
6*1=6 6*2=12 6*3=18 6*4=24 6*5=30 6*6=36
7*1=7 7*2=14 7*3=21 7*4=28 7*5=35 7*6=42 7*7=49
8*1=8 8*2=16 8*3=24 8*4=32 8*5=40 8*6=48 8*7=56 8*8=64
9*1=9 9*2=18 9*3=27 9*4=36 9*5=45 9*6=54 9*7=63 9*8=72 9*9=81
*/
void test_2() {
	int i, j;

	for(i = 1; i <= 9; i++) {
		for(j = 1; j <= i; j++) {
			printf("%d*%d=%d ", i, j, i * j);
		}

		putchar('\n');
	}
}
int main() {
	test_1();
	return 0;
}
